{
    "games" : {
        "description" : "Games, prototypes, and other specifically game-related projects I have worked on over the past few years.",
        "content" : [
            {
                "title" : "Shock Lobster: Shock & Claw",
                "tagline" : "\"In this gauntlet of sparks and robotic lobsters, will you shock and claw your way to the top?\"",
                "created" : "September 2022 - Present",
                "tech" : "Blender, Github, Unity 3D, Unity Universal Render Pipeline, Unity Shader Graph, Adobe Illustrator, C#",
                "details": "This is a passion project I have been working on since September 2022 that originated from a silly idea I had one day while brainstorming. The project is built using open source assets from the Unity Asset Store as well as many of my own creation. My assets include: animated and textured 3D models using Blender, and smooth and thematic UI using Adobe Illustrator. The current prototype has been playtested, but there is still a lot of room for improvement that is currently underway.\nAdditionally, I have been overhauling the scripts from the original prototype to be more cohesive as well as developer friendly. Namely, scripts are now broken up more appropriately, many settable variables in the inspector have descriptor headers, and the code includes more comments. Check back frequently for updates as March 2023 will be a very development heavy month!",
                "points": [
                    "Independent passion project",
                    "Utilizes open source and self made assets",
                    "Original textured and animated characters and UI assets",
                    "Organized code",
                    "First prototype completed, more polished version in development"
                ],
                "link": "https://github.com/lpd8987/ShockLobster/releases/tag/v0.0.4-pre-alpha"
            },
            {
                "title" : "An Empire of Bronze",
                "tagline" : "\"The ways of old have returned! Will you walk the path of the old gods, and forge an empire of bronze?\"",
                "created" : "December 2022 - January 2022",
                "tech" : "Visual Studio Code, Adobe Illustrator, ParadoxScript",
                "details": "This is a mod I created independently for the popular tactical history rpg Crusader Kings 3. Its lore is centered around bringing back the long gone kingdoms of the Bronze Age, with a twist of fantasy. All of the specifics can be found on the Steam Workshop page. The most challenging part of this project was trying to incorporate the correct variable and file structure outlined in the doucmentation, as most of it details modding prior versions of the game.",
                "points": [
                    "Independent project",
                    "Historical fantasy content addition to Crusader Kings 3 (tactical history rpg)",
                    "Adds additional roleplay opportunties (details on Steam Workshop page)",
                    "Experience reading and understanding documentation to aid development"
                ],
                "link": "https://steamcommunity.com/sharedfiles/filedetails/?id=2921475285"
            },
            {
                "title" : "Potions of Anxiety",
                "tagline" : "\"What lurks in the shadows of the mind?\"",
                "created" : "October 2022 - November 2022",
                "tech" : "Twine, Corel Painter Essentials 5, HTML, CSS, JavaScript",
                "details": "This is an interactive narrative I made for my Introduction to Interactive Narratives class in Fall 2022. Utilizing Twine, storytelling techniques, and basic CSS styling, I tried my hand at writing a narrative with multiple endings. ",
                "points": [
                    "Academic project",
                    "Interactive narrative featuring player choice",
                    "Basic CSS styling and HTML formatting",
                    "First attempt at writing original story"
                ],
                "link": "https://people.rit.edu/lpd8987/529/Twine3/Potions%20of%20Anxiety.html"
            },
            {
                "title" : "Abaddon",
                "tagline" : "\"In this 3D adventure game, use the unstable powers of pixie dust to regain your lost honor!\"",
                "created" : "January 2022 - May 2022",
                "tech" : "Unity 3D, Unity HDRP Render Pipeline, Perforce Version Control, Confluence (Documentation), C#",
                "details": "This is a senior capstone project hosted by the ArtCenter College of Design in California which I had the opportunity to work on in Spring 2022. As a programmer, my job was to create different dialogue systems using Unity's scriptable objects and coroutines. The dialogue system is similar to games like Undertale or Animal Crossing, in which each letter of a line of dialogue is printed one at a time, each playing a noise of character \"voice\". The output could then be further augmented by allowing devs to tweak pauses between letters and punctuation, as well as easily assign sets of sound clips held in scriptable objects.\nFurther, there were 3 different types of dialogue to implement: Ambient- triggered by walking up to NPCs and LERPing opacity, Tutorial- triggered by game events, and repeats until a specific condition is met, and Conversational- dialogue that creates a back-and-forth character interaction with different dialogue choices.",
                "points": [
                    "Academic project",
                    "Acted as developer on a senior capstone project",
                    "3 implementations of an Animal Crossing-like dialogue system",
                    "Ambient Dialouge- triggered by walking up to NPCs and LERPing opacity",
                    "Tutorial Dialogue- triggered by game events, and repeats until a specific condition is met",
                    "Conversational Dialogue- dialogue that creates a back-and-forth character interaction with different dialogue choices."
                ],
                "link": "https://joshmontague.itch.io/abaddon"
            },
            {
                "title" : "The Dungeon Under Chicago",
                "tagline" : "In this 2D rogue-like, explore the tunnels of Chicago, and uncover the dark magics lurking within!",
                "created" : "October 2021 - November 2021",
                "tech" : "Unity 2D, GitHub, Aseprite, C#",
                "details": "This is a prototype rouge-like I worked on as part of a group project Game Development class. During this project, I acted as project lead, helping guide the overall vision of the game through conceptualization and asset production using Aseprite to create and animate sprites. I also helped with some scripting behaviors and incorporation of level design. ",
                "points": [
                    "Academic project",
                    "2D rouge-like prototype featuring retro art style",
                    "Asset production using Aseprite",
                    "Original game music",
                    "Basic enemy AI scripting behaviors (shooting projectiles, follow player)"
                ],
                "link": "https://drive.google.com/file/d/15a3NdPe33SgQ-iY6E-pGK0sNPjiGkSqE/view",
                "git": "https://github.com/Aaron875/The-Dungeon-Under-Chicago-"
            },
            {
                "title" : "Wizdoku",
                "tagline" : "In this variation of a classic, solve Sudoku puzzles systematically to defeat your opponent!",
                "created" : "September 2021 - October 2021",
                "tech" : "Unity 2D, GitHub, Aseprite, C#",
                "details": "This is a prototype puzzle game I worked on as part of a group project Game Development class. During this project, I acted as asset lead, helping guide the overall vision of the game through conceptualization and asset production and implementation. I also helped create the basic AI for the opponent.",
                "points": [
                    "Academic project",
                    "2D puzzle game prototype featuring retro art style",
                    "Asset production using Aseprite",
                    "Basic enemy AI strategy (place tile) and tile effects"
                ],
                "link" : "https://drive.google.com/file/d/1Rt5TuJuowQR3yeLGgneKMt5DjSomkKRL/view",
                "git" : "https://github.com/Aaron875/WizDoku"
            }
        ]
    },
    "web-apps" : {
        "description" : "Web applications, websites, and web games I have worked on over the past few years.",
        "content" : [
            {
                "title" : "Coin Collector",
                "tagline" : "Collect coins, climb the leaderboard!",
                "created" : "November 2022 - December 2022",
                "tech" : "HTML, CSS, Bulma CSS, JavaScript, NodeJS, ReactJS, ExpressJS, PixiJS, Mongo DB, Redis, Heroku, GitHub, Circle CI",
                "details": "I created this web application for my Rich Media Applications II class. The focus of the app is leveraging backend frameworks via NodeJS and Mongo DB to create the experience of an online game that people can log on and try to climb the leaderboard. The game itself is very simple, but challenging, and the website affords users a multitude of options update their account information.",
                "points": [
                    "Academic project",
                    "Web application leveraging backend frameworks",
                    "Simple, yet challenging game made with Pixi JS",
                    "Account management system"
                ],
                "link": "https://ld-project-2.herokuapp.com/",
                "git": "https://github.com/lpd8987/430-Project-2"
            },
            {
                "title" : "Appunti Italiani - API",
                "tagline" : "An API and study tool for learners of Italian language",
                "created" : "September 2022 - October 2022",
                "tech" : "HTML, CSS, Bulma CSS, JavaScript, NodeJS, GitHub, Heroku, Circle CI",
                "details": "This is an API and web application I created for my Rich Media Applications II class. It is a simple API that uses Node JS to get vocabulary words and definititions from a list of terms for users to post to a central vocabulary study list. It is certainly a project that I would like to expand upon at some point due to my interest in Italian language.",
                "points": [
                    "Academic project",
                    "Web application using Node JS and frontend languages",
                    "Simple API that lets users make a list of vocabulary words"
                ],
                "link": "https://appunti-italiani-api.herokuapp.com/",
                "git": "https://github.com/lpd8987/430-Project-1"
            },
            {
                "title" : "Dead by Memelight",
                "tagline" : "A companion application to enhance playing Dead by Daylight",
                "created" : "August 2022",
                "tech" : "HTML, CSS, JavaScript, Local Storage",
                "details": "This is a simple independent project I spent a few days creating in August 2022 for myself and my friends. Drawing from a set of data, it generates perk and gear loadouts either randomized or of my own creation for players. I am in no way affiliated with the Behaviour game studio, and I made it clear in the application itself that the app is fanmade and not officially affiliated with the game or studio. Regardless, the application served my friends and I well during our game nights, and anyone else who would like to use it is more than welcome to!",
                "points": [
                    "Independent project",
                    "Web application using frontend languages",
                    "Generates player builds and gear from a set of data"
                ],
                "link": "https://people.rit.edu/lpd8987/DeadByMemelight/",
                "git": ""
            },
            {
                "title" : "Jello Jump",
                "tagline" : "Jump and collect crowns as fast as you can!",
                "created" : "April 2022 - May 2022",
                "tech" : "HTML, HTML Canvas, CSS, Bulma CSS, JavaScript, Local Storage, MatterJS, GitHub",
                "details": "This is a project I worked on in tandem with a teammate for my Rich Media Applications I class. We created a 2D platformer web game using a combination of Matter JS- a physics simulation JavaScript framework, and HTML Canvas. Additional challenge was added to the game by posing the challenge to players to get the fastest time they could while grabbing collectibles. In particular, I spent most of my time setting up the game and its assets. My teammate was responsible for the overall styling of the site and our custom components",
                "points": [
                    "Academic project",
                    "Web application and 2D platformer using frontend languages and frameworks",
                    "Challenges players to get the fastest time while grabbing collectibles"
                ],
                "link": "https://people.rit.edu/lpd8987/330/project-2/about.html",
                "git": "https://github.com/awc1437332/330_Project_2"
            },
            {
                "title" : "Animazione Italiana",
                "tagline" : "A detailed history and exploration of Italian Animation in website format",
                "created" : "April 2022 - May 2022",
                "tech" : "HTML, CSS, Bulma CSS, JavaScript, GitHub",
                "details": "This is a website I created for my final project for my class about Modern Italian Cinema. Instead of writing a report, I chose to make it in a website format to make it more interactive and visually appealing- by having direct links to the films I discussed in the report. I had originally planned to have a forum/discussion section of the website, but it was a stretch goal I did not get to.",
                "points": [
                    "Academic/Independent project",
                    "Report in website format",
                    "Creative avenue for detailing information on a specific subject"
                ],
                "link": "https://people.rit.edu/lpd8987/351/",
                "git": ""
            },
            {
                "title" : "Eques",
                "tagline" : "In this text-based adventure, traverse the land and battle enemies!",
                "created" : "April 2021 - May 2021",
                "tech" : "HTML, CSS, JavaScript, PixiJS",
                "details": "This is a web game I created for my Web Technology for Game Developers class. It uses Pixi JS and basic JavaScipt functionality to make a text-based adventure game that allows for exploration and combat. The descriptions for each room are also adaptive depending on whether the player has visited/interacted with the room before.",
                "points": [
                    "Academic project",
                    "Text-based adventure game",
                    "Exploration and combat system",
                    "Adaptive text"
                ],
                "link": "https://people.rit.edu/lpd8987/235/project3/game.html",
                "git": ""
            }
        ]
    }
    
}